
### Pull Request Information
Please review this PR. Merging the PR will run Terraform Apply with the below plan.

#### Terraform Checks
Init: `success`
Format: `success`
Validation: `success`
Plan: `success`

#### Checkov
Static: ``
Plan: `success`

<details><summary>Plan File</summary>

```terraform
azurerm_resource_group.main_rg: Refreshing state... [id=/subscriptions/cffda582-a060-4e87-994f-9cff463aa651/resourceGroups/test-dev-eastus-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vnet.azurerm_subnet.subnet["subnet1"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "test-dev-eastus-vnet-web-subnet"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "test-dev-eastus-rg"
      + virtual_network_name                           = "test-dev-eastus-vnet"
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "test-dev-eastus-vnet"
      + resource_group_name = "test-dev-eastus-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "DeployedFrom" = "terraform"
          + "environment"  = "dev"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

